/* Напишете програма, която изчислява какви разходи ще има Джеси, ако започне да тренира,
като знаете колко е таксата за тренировки по баскетбол за период от 1 година. Нужна екипировка: 
•	Баскетболни кецове – цената им е 40% по-малка от таксата за една година
•	Баскетболен екип – цената му е 20% по-евтина от тази на кецовете
•	Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип
•	Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка
Вход От конзолата се четe 1 ред:
•	Годишната такса за тренировки по баскетбол – цяло число в интервала [0… 9999]
Изход Да се отпечата на конзолата колко ще са разходите на Джеси, ако започне да спортува баскетбол.
 */
function basketballEquipment(input) {
    let annualFee = Number(input[0]);
    let priceSneakers = annualFee * 0.60;
    let priceEqupment = priceSneakers * 0.80;
    let priceBall = priceEqupment * 0.25;
    let priceAccessories = priceBall * 0.20;
    console.log(annualFee + priceSneakers + priceEqupment + priceBall + priceAccessories);
}

basketballEquipment (["550"])